testCases/heatTransfer/90x150/constant/reactions
species
(
    N2
    EMs
    EMg
);

reactions
{

}
